app/controllers/api/items_controller.rb

  def create
    item = Item.new(item_params)
    if item.save
---
INSERT INTO "items" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Dance if you want to"], ["created_at", "2016-07-12 15:21:06.998454"], ["updated_at", "2016-07-12 15:21:06.998454"]]

  def update
    item = Item.find(params[:id])
    if item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "items" SET "completed" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["completed", "t"], ["updated_at", "2016-07-15 16:43:55.879677"], ["id", 2]]