app/controllers/api/lists_controller.rb

  def create
    list = List.new(list_params)
    if list.save
---
INSERT INTO "lists" ("name", "permissions", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Things to do today"], ["permissions", "Private"], ["created_at", "2016-07-12 15:20:49.784792"], ["updated_at", "2016-07-12 15:20:49.784792"]]

  def destroy
    begin
      list = List.find(params[:id])
      list.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]

  def update
    list = List.find(params[:id])
    if list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "lists" SET "permissions" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["permissions", "private"], ["updated_at", "2016-07-15 04:32:56.989028"], ["id", 2]]