app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Sterling"], ["password_digest", "Archer"], ["created_at", "2016-07-12 13:36:34.961037"], ["updated_at", "2016-07-12 13:36:34.961037"]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    begin
      user = User.find(params[:id])
      user.destroy